Revit 2027 API
BuiltInFailures.SystemsFailures.AddingOtherConnectedMembersToSystem Property
 "You have selected elements that are connected to other elements. These elements will also be added to the System."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AddingOtherConnectedMembersToSystem { get; }
Public Shared ReadOnly Property AddingOtherConnectedMembersToSystem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AddingOtherConnectedMembersToSystem {
	FailureDefinitionId^ get ();
}
static member AddingOtherConnectedMembersToSystem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace